const ap = new APlayer({
    container: document.getElementById('aplayer'),
    autoplay: false, //自动播放
    theme: '#FF69B4', //主题色
    loop: 'all', //音频循环播放, 可选值: 'all'全部循环, 'one'单曲循环, 'none'不循环
    order: 'list', //音频循环顺序, 可选值: 'list'列表循环, 'random'随机循环
    preload: 'auto', //预加载，可选值: 'none', 'metadata', 'auto'
    volume: 0.7, //默认音量，请注意播放器会记忆用户设置，用户手动设置音量后默认音量即失效
    mutex: true, //互斥，阻止多个播放器同时播放，当前播放器播放时暂停其他播放器
    fixed: true,
    lrcType: 2,//歌词传递方式
    audio: [
        {
            name: '我乐意',
            artist: '许嵩',
            lrc: '[ti:我乐意]\n[ar:许嵩]\n[al:我乐意]\n[by:天龙888]\n[00:00.00]许嵩 - 我乐意\n[00:01.28]作词：许嵩\n[00:01.93]作曲：许嵩\n[00:02.60]编曲：蔡廷贵、许嵩\n[00:03.81]制作人：许嵩\n[00:04.67]和声编写：许嵩\n[00:05.63]和声：许嵩\n[00:06.30]录音师：许嵩\n[00:07.15]混音师：许嵩\n[00:07.97]母带处理工程：许嵩\n[00:08.97]LRC歌词制作：LOVE109❤️纪实小屋\n[00:10.97]❤️ www.love109.cn ❤️\n[00:13.94]潇洒如我\n[00:14.75]最近却变得有点敏感\n[00:18.24]半小时收不到你讯息\n[00:20.72]就会坐立不安\n[00:22.80]都说别爱的太满\n[00:25.31]这道理知易行难\n[00:27.31]我还挺乐意享受\n[00:29.19]这份甜中微酸\n[00:31.72]你的笑像西瓜最中间\n[00:34.21]那一勺的口感\n[00:36.18]点亮了一整个夏天\n[00:38.37]星空也为你斑斓\n[00:40.70]我不会深情款款\n[00:42.98]上演什么套路桥段\n[00:45.12]我的爱纯粹简单\n[00:50.93]我乐意站在你身后\n[00:53.11]把你揽在胸口\n[00:55.18]低头看你素净的脸颊粉红\n[00:59.91]我乐意把着你的手\n[01:02.95]心猿意马弹奏\n[01:04.22]每颗音符里都有幸福闪动\n[01:08.73]我乐意守在你左右\n[01:11.23]为你挡雨遮风\n[01:13.20]今后的路我陪你一起走过\n[01:17.57]我乐意把自己奉送\n[01:20.00]做你独家宇宙\n[01:22.23]抱着你旁若无人尽情舞动\n[01:32.41]你的笑像西瓜最中间\n[01:34.74]那一勺的口感\n[01:36.82]点亮了一整个夏天\n[01:38.94]星空也为你斑斓\n[01:41.22]我不会深情款款\n[01:43.14]上演什么套路桥段\n[01:45.67]我的爱纯粹简单\n[01:51.31]我乐意站在你身后\n[01:53.69]把你揽在胸口\n[01:55.77]低头看你素净的脸颊粉红\n[02:00.43]我乐意把着你的手\n[02:02.67]心猿意马弹奏\n[02:04.75]每颗音符里都有幸福闪动\n[02:09.22]我乐意守在你左右\n[02:11.56]为你挡雨遮风\n[02:13.74]今后的路我陪你一起走过\n[02:18.11]我乐意把自己奉送\n[02:20.60]做你独家宇宙\n[02:22.78]抱着你旁若无人尽情舞动\n[02:30.81]我非常乐意\n[02:32.49]为你做任何任何的事情\n[02:36.39]你说只要求我\n[02:37.50]每天过得开心\n[02:39.78]我非常乐意\n[02:41.40]陪你到任何任何地方去\n[02:45.51]你说今年秋天想去趟南极\n[02:48.70]我非常乐意看着你的眼睛\n[02:52.96]落俗而真诚的\n[02:55.45]说出那一句我爱你\n[03:05.53]我乐意站在你身后\n[03:07.66]把你揽在胸口\n[03:09.85]低头看你素净的脸颊粉红\n[03:14.30]我乐意把着你的手\n[03:16.68]心猿意马弹奏\n[03:18.81]每颗音符里都有幸福闪动\n[03:23.18]我乐意守在你左右\n[03:25.61]为你挡雨遮风\n[03:27.74]今后的路我陪你一起走过\n[03:32.20]我乐意把自己奉送\n[03:34.63]做你独家宇宙\n[03:36.82]抱着你旁若无人尽情舞动\n[03:41.24]我乐意守在你左右\n[03:43.62]为你挡雨遮风\n[03:45.75]今后的路我陪你一起走过\n[03:50.13]我乐意把自己奉送\n[03:52.57]做你独家宇宙\n[03:54.90]抱着你旁若无人尽情舞动\n',
            url: 'http://www.ytmp3.cn/down/48682.mp3',
            cover: 'https://p2.music.126.net/dwvPvZ3HL_nzRoZHJP_KJw==/109951163261278540.jpg?param=130y130',
        },
        {
            name: '恶魔的爱',
            artist: '李宏毅/李明霖',
            url: 'http://www.ytmp3.cn/down/36971.mp3',
            cover: 'https://p1.music.126.net/paLaPUorjlzdWYZ-HHPPxg==/19223861300040992.jpg?param=130y130',
        },
        {
            name: '咱们结婚吧',
            artist: '齐晨',
            lrc: '[ti:咱们结婚吧]\n[ar:齐晨]\n[al:咱们结婚吧]\n[by:听风细雨]\n[00:00.00]咱们结婚吧\n[00:02.00]作词：Jane欢欢/张维\n[00:06.00]作曲：高磊\n[00:08.00]演唱：齐晨\n[00:13.69]发行：黑眼睛文化\n[00:15.00]LRC歌词制作：LOVE109❤️纪实小屋\n[00:17.00]❤️ www.love109.cn ❤️\n[00:19.45]洁白的婚纱 手捧着鲜花\n[00:23.94]美丽得像童话\n[00:28.11]想起那年初夏 我为你牵挂\n[00:32.44]在一起就犯傻\n[00:34.91]丘比特轻轻飞过月光下\n[00:39.25]潘多拉她听到了回答\n[00:43.61]礼堂钟声 在敲打 幸福的密码\n[00:52.43]哦 My Love 咱们结婚吧\n[00:56.95]好想和你拥有一个家\n[01:00.87]这一生最美的梦啊\n[01:05.53]有你陪伴我同闯天涯\n[01:09.50]哦 My Love 咱们结婚吧\n[01:14.10]我会用一生去爱你的\n[01:18.50]我愿把一切都放下\n[01:22.99]给你幸福的家\n[01:27.40]\n[01:47.31]洁白的婚纱 手捧着鲜花\n[01:51.78]美丽得像童话\n[01:56.03]想起那年初夏 我为你牵挂\n[02:00.41]在一起就犯傻\n[02:02.60]丘比特轻轻飞过月光下\n[02:07.27]潘多拉她听到了回答\n[02:11.46]礼堂钟声 在敲打 幸福的密码\n[02:20.19]哦 My Love 咱们结婚吧\n[02:24.85]好想和你拥有一个家\n[02:28.77]这一生最美的梦啊\n[02:33.39]有你陪伴我同闯天涯\n[02:37.35]哦 My Love 咱们结婚吧\n[02:41.97]我会用一生去爱你的\n[02:46.31]我愿把一切都放下\n[02:50.80]给你幸福的家\n[02:54.88]\n[02:56.46]哦 My Love 咱们结婚吧\n[03:01.30]好想和你拥有一个家\n[03:05.21]这一生最美的梦啊\n[03:09.92]有你陪伴我同闯天涯\n[03:13.77]哦 My Love 咱们结婚吧\n[03:18.38]我会用一生去爱你的\n[03:22.66]我愿把一切都放下\n[03:27.35]给你幸福的家\n[03:31.01]\n',
            url: 'http://www.ytmp3.cn/down/32874.mp3',
            cover: 'https://p1.music.126.net/Hu18fnqGdPDjAEIidBeNLw==/5784530673779689.jpg?param=130y130',
        },
        {
            name: '最佳歌手',
            artist: '许嵩',
            lrc: '[ti:最佳歌手]\n[ar:许嵩]\n[al:]\n[by:果果1314]\n[00:00.00]最佳歌手 - 许嵩\n[00:00.35]词曲：许嵩\n[00:00.70]LRC歌词制作：LOVE109❤️纪实小屋\n[00:01.00]❤️ www.love109.cn ❤️\n[00:01.60]\n[00:02.17]我们最好的遇见\n[00:06.03]是现在这样的四月\n[00:10.26]柳絮抚着那条街\n[00:14.04]像大雪一样的热烈\n[00:18.13]你轻轻唱起我的歌\n[00:22.10]我受宠若惊的喜悦\n[00:26.34]绝佳的歌艺里面\n[00:29.85]多少故事做铺垫\n[00:34.27]\n[00:38.15]我们最好的告别\n[00:42.03]是现在这样没红眼\n[00:46.19]因你而起的一泓喜悲\n[00:49.62]权当年轻留个纪念\n[00:54.22]清晨回笼做了梦\n[00:57.95]你成明星开演唱会\n[01:02.28]场馆里歌迷很多\n[01:05.56]我被人潮推到尽头\n[01:10.07]你在台上唱着我的创作\n[01:14.07]布局谋篇像本悲情小说\n[01:18.13]你太擅长表演\n[01:21.27]表情淡漠反倒有催泪效果\n[01:26.10]我在台下已经开始感动\n[01:30.28]大屏幕里忽然给我镜头\n[01:34.51]微笑挥挥手多懂事的观众\n[01:42.63]\n[01:58.35]初见和告别之间\n[02:01.96]回想只剩星星点点\n[02:06.27]曾以为刻骨细节\n[02:09.92]在骨灰里面怎么捡\n[02:14.19]沿着环路兜一圈\n[02:17.91]循环放你唱过的歌\n[02:21.86]心里的舞台已启幕\n[02:25.54]主角登场引来掌声雷动\n[02:30.02]你在台上唱着我的创作\n[02:34.04]布局谋篇像本悲情小说\n[02:38.05]你太擅长表演\n[02:41.09]表情淡漠反倒有催泪效果\n[02:46.11]我在台下已经开始感动\n[02:49.99]大屏幕里忽然给我镜头\n[02:54.34]微笑挥挥手多懂事的观众\n[03:01.85]你在台上唱着我的创作\n[03:06.18]布局谋篇像本悲情小说\n[03:10.13]你太擅长表演\n[03:13.20]表情淡漠反倒有催泪效果\n[03:18.12]我在台下已经开始感动\n[03:22.06]整个世界全是你的镜头\n[03:26.53]听完这一首就理性的退后\n[03:34.83]\n[03:38.33]直到某一天碰面\n[03:41.97]在某家餐厅或商店\n[03:46.27]你挽着他和我擦肩还好\n[03:50.56]我手也有人牵\n[03:54.32]广播里响起的歌\n[03:57.93]是恍若隔世的注解\n[04:02.31]最佳歌手的头衔\n[04:05.55]大致上有了人选\n[04:10.18]最佳歌手的感言\n[04:14.33]记得要慢慢念\n[04:22.29]LRC歌词制作：LOVE109❤️纪实小屋\n[04:25.00]❤️ www.love109.cn ❤️\n[04:27.00]\n',
            url: 'http://www.ytmp3.cn/down/50444.mp3',
            cover: 'https://p1.music.126.net/Wcs2dbukFx3TUWkRuxVCpw==/3431575794705764.jpg?param=130y130',
        },
        {
            name: '白羊',
            artist: '徐秉龙/沈以诚',
            lrc: '[ti:白羊]\n[ar:沈以诚&徐秉龙]\n[al:]\n[by:果果1314]\n[00:00.00]徐秉龙、沈以诚 - 白羊\n[00:01.00]词：徐秉龙\n[00:02.00]曲：徐秉龙\n[00:03.00]\n[00:04.89]你有多少胜算\n[00:07.04]把我困在里面\n[00:09.13]你设计的城堡太糟糕\n[00:13.54]我一起飞就能逃跑\n[00:17.99]可你粲然一笑\n[00:20.09]我心事就潦草\n[00:22.56]你裙下的人间太美妙\n[00:27.39]好想把你一口气全部吃掉\n[00:32.34]\n[00:34.62]多热烈的白羊\n[00:36.80]多善良多抽象\n[00:39.12]多完美的她呀\n[00:41.16]却是下落不详\n[00:43.70]心好空荡\n[00:45.78]都快要失去形状\n[00:52.59]青春一记荒唐\n[00:54.85]亦然学着疯狂\n[00:57.17]这声色太张扬\n[00:59.35]这欢愉太理想\n[01:01.68]先熄灭心跳\n[01:04.32]才能拥抱\n[01:08.51]\n[01:09.53]编曲：徐秉龙\n[01:10.54]制作人：徐秉龙\n[01:11.42]和声编写：徐秉龙\n[01:12.62]和声配唱：徐秉龙\n[01:13.73]吉他：徐秉龙\n[01:14.78]鼓：徐秉龙\n[01:15.89]B-Box：陆颢哲\n[01:17.04]Program：周果亦\n[01:18.05]吉他编写：徐秉龙/武言圣\n[01:19.40]混音：谭聪\n[01:20.53]母带：谭聪\n[01:21.73]封面设计：徐秉龙\n[01:22.99]发行公司：亚合娱乐\n[01:24.37]LRC歌词制作：LOVE109❤️纪实小屋\n[01:26.94]❤️ www.love109.cn ❤️\n[01:27.31]\n[01:30.81]几千几万个你\n[01:33.21]几千几万个我\n[01:35.26]一起躲进这浪漫的回合\n[01:40.01]然后沉迷你诗写一般的身体\n[01:47.13]多热烈的白羊\n[01:49.34]热烈得好抽象\n[01:51.47]抽象掩盖欲望\n[01:53.70]却又欲盖弥彰\n[01:56.03]我要嚣张\n[01:58.34]嚣张到失去形状\n[02:04.92]青春一记荒唐\n[02:07.49]亦然学着疯狂\n[02:09.64]这声色太张扬\n[02:11.93]这欢愉太理想\n[02:14.32]先熄灭心跳\n[02:17.12]才能拥抱\n[02:23.29]青春一记荒唐\n[02:25.69]亦然学着疯狂\n[02:27.84]这声色太张扬\n[02:30.12]这欢愉太理想\n[02:32.67]这归途太远\n[02:35.37]要迷人且倔强\n[02:40.87]\n',
            url: 'http://www.ytmp3.cn/down/54977.mp3',
            cover: 'https://p2.music.126.net/tczb_7II9KzSuLQsVt89Gw==/109951163049336667.jpg?param=130y130',
        },
        {
            name: '走心',
            artist: '贺敬轩',
            lrc: '[ti:走心]\n[ar:贺敬轩]\n[al:]\n[by:吉时雨]\n[00:00.00]贺敬轩 - 走心\n[00:01.10]作词：郑建浩\n[00:02.20]作曲：郑建浩\n[00:03.30]编曲：许笑荣\n[00:04.40]监制：周晓明\n[00:05.50]混音：周晓明\n[00:06.60]制作人：林华勇\n[00:07.70]LRC歌词制作：LOVE109❤️纪实小屋\n[00:09.90]❤️ www.love109.cn ❤️\n[00:11.00]\n[00:12.43]这城市比沙漠还冷清\n[00:15.47]少了一个你\n[00:19.94]一边压抑悲观的情绪\n[00:23.04]一边学开心\n[00:27.23]我在书里寻找欢声笑语\n[00:31.35]我在旅行中释放掉回忆\n[00:34.89]没伤心 也没有顾虑\n[00:41.55]\n[00:42.89]摩天轮最高处的美景\n[00:45.48]不太像爱情\n[00:49.85]慢慢落下我失重的心\n[00:53.03]受不住侵袭\n[00:57.17]关于你的梦我都想还你\n[01:01.16]在你肩膀的温馨也丢弃\n[01:04.67]这故事 也不需要你\n[01:11.36]\n[01:12.38]让我最幸运的最努力的\n[01:14.63]最满足的就是能走近你\n[01:19.34]让我最遗憾的最痛苦的\n[01:22.07]就是没能走进你的心里\n[01:26.10]\n[01:27.14]我们陌生得没有再相遇\n[01:31.07]是你给我最长久的感情\n[01:34.48]全都失去 也不差失去你\n[01:41.30]\n[01:42.41]你所说的每句每个表情\n[01:44.58]都敷衍得那么不够走心\n[01:49.65]我也不再喜欢不再想起\n[01:51.96]不再贪图太奢侈的风景\n[01:56.18]\n[01:57.09]最简单的是再也回不去\n[02:01.12]我们就这样隔为疏离\n[02:05.01]看谁先学会忘记\n[02:12.31]\n[02:38.91]摩天轮最高处的美景\n[02:41.64]不太像爱情\n[02:46.15]慢慢落下我失重的心\n[02:49.19]受不住侵袭\n[02:53.62]关于你的梦我都想还你\n[02:57.58]在你肩膀的温馨也丢弃\n[03:00.75]这故事 也不需要你\n[03:07.51]\n[03:08.33]让我最幸运的最努力的\n[03:10.75]最满足的就是能走近你\n[03:15.68]让我最遗憾的最痛苦的\n[03:18.29]就是没能走进你的心里\n[03:22.30]\n[03:23.42]我们陌生得没有再相遇\n[03:27.29]是你给我最长久的感情\n[03:30.43]全都失去 也不差失去你\n[03:38.07]\n[03:38.73]你所说的每句每个表情\n[03:41.04]都敷衍得那么不够走心\n[03:45.82]我也不再喜欢不再想起\n[03:48.39]不再贪图太奢侈的风景\n[03:52.43]\n[03:53.37]最简单的是再也回不去\n[03:57.33]我们就这样隔为疏离\n[04:01.11]看谁先学会忘记\n[04:07.94]\n[04:08.56]让我最幸运的最努力的\n[04:10.75]最满足的就是能走近你\n[04:15.67]让我最遗憾的最痛苦的\n[04:18.25]就是没能走进你的心里\n[04:22.31]\n[04:23.43]我们陌生得没有再相遇\n[04:27.38]是你给我最长久的感情\n[04:30.86]全都失去 也不差失去你\n[04:38.12]\n[04:38.68]你所说的每句每个表情\n[04:40.82]都敷衍得那么不够走心\n[04:45.84]我也不再喜欢不再想起\n[04:48.17]不再贪图太奢侈的风景\n[04:52.54]\n[04:53.30]最简单的是再也回不去\[04:57.39]我们就这样隔为疏离\n[05:01.12]看谁先学会忘记\n[05:08.59]\n',
            url: 'http://www.ytmp3.cn/down/55007.mp3',
            cover: 'https://p2.music.126.net/DmX_-LkkpSB11t59idHDtw==/109951163178064565.jpg?param=130y130',
        },
    ]
});